Revit 2027 API
FamilyInstance.FlipFromToRoom Method
 Flips the settings of "From Room" and "To Room" for the door or window instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void FlipFromToRoom()
Public Sub FlipFromToRoom
public:
void FlipFromToRoom()
member FlipFromToRoom : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException | Thrown when the FamilyInstance is neither a door nor a window.
See Also
Reference
FamilyInstance Class
Autodesk.Revit.DB Namespace